[Killed] Block
testing-workshop/measuring-effectiveness/mutation/order-service.js:2:52
 class OrderService {
-  CalculatePrice(userType, productPrice, isOnSale) {
-    if (isOnSale) {
-      return productPrice * 0.8;
-    } else if (userType === "premium") {
-      return productPrice * 0.9;
-    }
-
-    return productPrice;
-  }
+  CalculatePrice(userType, productPrice, isOnSale) {}
 }
 

[Killed] IfStatement
testing-workshop/measuring-effectiveness/mutation/order-service.js:3:9
 class OrderService {
   CalculatePrice(userType, productPrice, isOnSale) {
-    if (isOnSale) {
+    if (true) {
       return productPrice * 0.8;
     } else if (userType === "premium") {

[Survived] IfStatement
testing-workshop/measuring-effectiveness/mutation/order-service.js:3:9
 class OrderService {
   CalculatePrice(userType, productPrice, isOnSale) {
-    if (isOnSale) {
+    if (false) {
       return productPrice * 0.8;
     } else if (userType === "premium") {

[Survived] BinaryExpression
testing-workshop/measuring-effectiveness/mutation/order-service.js:4:14
 class OrderService {
   CalculatePrice(userType, productPrice, isOnSale) {
     if (isOnSale) {
-      return productPrice * 0.8;
+      return productPrice / 0.8;
     } else if (userType === "premium") {
       return productPrice * 0.9;

[Killed] IfStatement
testing-workshop/measuring-effectiveness/mutation/order-service.js:5:16
   CalculatePrice(userType, productPrice, isOnSale) {
     if (isOnSale) {
       return productPrice * 0.8;
-    } else if (userType === "premium") {
+    } else if (false) {
       return productPrice * 0.9;
     }

[Killed] BinaryExpression
testing-workshop/measuring-effectiveness/mutation/order-service.js:5:16
   CalculatePrice(userType, productPrice, isOnSale) {
     if (isOnSale) {
       return productPrice * 0.8;
-    } else if (userType === "premium") {
+    } else if (userType !== "premium") {
       return productPrice * 0.9;
     }

[Killed] BinaryExpression
testing-workshop/measuring-effectiveness/mutation/order-service.js:6:14
     if (isOnSale) {
       return productPrice * 0.8;
     } else if (userType === "premium") {
-      return productPrice * 0.9;
+      return productPrice / 0.9;
     }
 
