[Survived] Block
testing-workshop/measuring-effectiveness/mutation/order-service.js:2:52
 class OrderService {
-  CalculatePrice(userType, productPrice, isOnSale) {
-    if (isOnSale) {
-      return productPrice * 0.7;
-    } else if (userType === "premium") {
-      return productPrice * 0.9;
-    }
-
-    return productPrice;
-  }
+  CalculatePrice(userType, productPrice, isOnSale) {}
 }
 

[Survived] BinaryExpression
testing-workshop/measuring-effectiveness/mutation/order-service.js:4:14
 class OrderService {
   CalculatePrice(userType, productPrice, isOnSale) {
     if (isOnSale) {
-      return productPrice * 0.7;
+      return productPrice / 0.7;
     } else if (userType === "premium") {
       return productPrice * 0.9;

[Survived] IfStatement
testing-workshop/measuring-effectiveness/mutation/order-service.js:5:16
   CalculatePrice(userType, productPrice, isOnSale) {
     if (isOnSale) {
       return productPrice * 0.7;
-    } else if (userType === "premium") {
+    } else if (false) {
       return productPrice * 0.9;
     }

[Survived] IfStatement
testing-workshop/measuring-effectiveness/mutation/order-service.js:5:16
   CalculatePrice(userType, productPrice, isOnSale) {
     if (isOnSale) {
       return productPrice * 0.7;
-    } else if (userType === "premium") {
+    } else if (true) {
       return productPrice * 0.9;
     }
